'''
format用法
'''
# a=f"名字是：{0},年龄是：{1}"
# print(a.format("lxr","30"))

a = "名字是：{0},年龄是：{1}"
print(a.format("lxr", "30"))
a = "名字是：{0},年龄是：{1},{0}是个好小伙"
print(a.format("lxr", "30"))
a = "名字是：{name},年龄是：{age}"
print(a.format(name="lxr", age="30"))

'''
填充和对齐
填充常跟对齐一起使用
^、<、>分别是居中、左对齐、右对齐，后面带宽度
:号后面带填充的字符，只能是一个字符，不指定的话默认是用空格填充
'''
print("{:*^9}".format("245"))
print("我是{0}，我喜欢数字{1:*^9}".format("lxr", "666"))

a="我是{0},我的存款有{1:2f}"
print(a.format("lxr", 3888.2344554))

'''
例子
'''

a = 3.1415926
b=3
print("{:.2f}".format(a))  # 输出：3.14
print(f"{a:.2f}")  # 输出：3.14
print(f"{a:+.2f}")#输出+3.14
print(f"{a:.0f}")   #输出3
print(f"{b:0>6d}") #输出000003

