'''
+,-,*,/,//,% 加，减，乘，浮点除、整数除、取余
and, or, not 布尔与、布尔或、布尔非
is, is not 同一性判断，判断是否为同一个对象
<,<=,>,>=,!=,== 比较值是否相当，可以连用
|,^,& 按位或，按位异或、按位与
<<,>> 移位
~ 按位翻转
** 幂运算
'''
#比较运算符
a=4
3<a<10

#位操作
a=0b11001
b=0b01000
c=a|b
print (bin(c))
print(bin(a&b))
print(bin(a^b))

x=3
print(x<<2)#左移动1位相当于乘以2,左移2位相当于乘以4
print(x>>1)#右移动1位相当于除以2

#加法操作
a=3+2 #相当于 ==>5
#字符串拼接
print('3'+'2')
#列表，元组等合并
print([10,20,30]+[5,10,100])

#乘法操作
a=3*2
#字符串复制
print('lxr'*3)
#列表元组复制
print([10,20,30]*3)

'''
运算符优先级
**
~
*,/,%,//
+,-
>>,<<
&
^,|
<,=<,>,>=
<>,==,!=
=,%=,/=,//=.-=,+=,*=,**=
is,is not
in, not in
not,or,and
从大到小
'''
y=1
print((5+10*x)/5-13*(y-1)*(a+b)//x+9*(5/x+(12+x)/y))
